# ToolTip Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RibbonItemData..::..ToolTip Property
RibbonItemData Class See Also
---
The description that appears as a ToolTip for the item.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string ToolTip { get; set; }
```

Visual Basic
---
```text
Public Property ToolTip As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ ToolTip {
	String^ get ();
	void set (String^ value);
}
```

# Remarks
The text that is displayed when the mouse pointer moves over the item. SplitButton and RadioButtonGroup cannot display the tooltip set by this method, the SplitButton will always show the current PushButton tooltip, and RadioButtonGroup has no tooltip.
# See Also
RibbonItemData Class
Autodesk.Revit.UI Namespace